OpenDTEF-v2012/tutorials/heatTransfer/buoyantSimpleFoam/roomWithThickCeiling/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh

restore0Dir

# change to mapped BC the polyPatch
runApplication changeDictionary

runApplication $(getApplication)

#------------------------------------------------------------------------------
